PANDAS

In [1]:
import pandas as pd
import numpy as np

In [5]:
#creating a dataframe

df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=['Col1','Col2','Col3','Col4'])
df.head()

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [6]:
#converting to csv
df.to_csv('Test1.csv')

In [7]:
#accessing the elements
df.loc['Row1']

Col1    0
Col2    1
Col3    2
Col4    3
Name: Row1, dtype: int64

In [10]:
type(df.loc['Row1']) #it is a series
#series is 1 row or 1 column

pandas.core.series.Series

In [12]:
df.iloc[:,:]

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [13]:
df.iloc[0:3,0:2]

      Col1  Col2
Row1     0     1
Row2     4     5
Row3     8     9

In [14]:
type(df.iloc[0:3,0:2])

pandas.core.frame.DataFrame

In [17]:
#converting dataframes into array
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [18]:
df.isnull().sum()

Col1    0
Col2    0
Col3    0
Col4    0
dtype: int64

In [20]:
df['Col1'].value_counts()

Col1
0     1
4     1
8     1
12    1
16    1
Name: count, dtype: int64

In [22]:
df['Col1'].unique() #shows unique values form column 1

array([ 0,  4,  8, 12, 16])

In [25]:
#indexing with column name
df[['Col3','Col4']] #multiple column name put inside list

      Col3  Col4
Row1     2     3
Row2     6     7
Row3    10    11
Row4    14    15
Row5    18    19